sg9924/stm32f103-Custom_RTOS/RTOS - Priority Scheduler v5/rtos_task.h
#ifndef __RTOSTASK_H__
#define __RTOSTASK_H__
#include<stdint.h>

#include "rtos_config.h"
#include "stm32f103xx_utilities.h"


//Task States
#define TASK_STATE_READY            ('A')
#define TASK_STATE_RUNNING          ('R')
#define TASK_STATE_BLOCKED          ('B')

//Task Notify Actions
#define TASK_NOTIFY_ACTION_SET      0
#define TASK_NOTIFY_ACTION_OR       1
#define TASK_NOTIFY_ACTION_INC      2

#define TASK_NOTIFY_STATE_NONE      0
#define TASK_NOTIFY_STATE_PENDING   1
#define TASK_NOTIFY_STATE_RECEIVED  2


typedef void(*ptask_t)(void);       //task function pointer

//Task control Block
//!order of structure members should not be changed!
typedef struct tcb
{
    uint32_t*    pstack;                             //pointer to the stack
    uint8_t      stack_size_word;                    //size of task stack in words
    struct tcb*  pnext;                              //pointer to the next tcb structure (linked list)
    ptask_t      ptask_func;                         //pointer to the task function
    uint8_t      task_id;
    uint8_t      task_state;                         //task state
    char*        task_desc;                          //task description
    uint32_t     block_tick;                         //ticks for which the task should be blocked
    uint8_t      task_priority;                      //priority: 0 (highest) to 255 (lowest)
    uint32_t     task_noti_value;                    //task notification value
    uint8_t      task_noti_state;                    //task notification state
}tcb_t;

void __task_count_init(void);
void taskAdd_Idle();
tcb_t* taskAdd_Priority(ptask_t func_ptr, char* task_desc, uint8_t task_priority, uint8_t stack_size_word);


void taskDelay(uint32_t delay_tick);
void taskBlock(tcb_t* task, uint32_t timeout_tick);
void taskUnblock(void);
void taskYield(bool higherPriorityTaskWoken);
void taskYieldFromISR(bool higherPriorityTaskWoken);

ptask_t getTaskFunc(uint8_t task_num);
ptask_t* getTaskFunc_List();

tcb_t* getTask_Idle();
tcb_t* getTask_List();
uint8_t getTask_Count();
tcb_t* getTask_Priority(uint8_t priority);

//Task Notifications
void taskNotify_Reset(tcb_t* task);
void taskNotify_Set(tcb_t* task, uint32_t value, uint8_t state, uint8_t index);

void taskNotify_Send(tcb_t* task, uint32_t value, uint8_t action);
uint32_t taskNotify_Wait(uint32_t clear_on_entry_mask, uint32_t clear_on_exit_mask, uint32_t* out, uint32_t wait_tick);

#endif